src/СРМ/src/Catalogs/СпискиСтатусовЗадач/СпискиСтатусовЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СпискиСтатусовЗадач</name>
  <predefined>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>Выполненные</name>
      <description>Выполненные</description>
    </items>
    <items>
      <name>Закрытые</name>
      <description>Закрытые</description>
    </items>
    <items>
      <name>КВыполнению</name>
      <description>К выполнению</description>
    </items>
    <items>
      <name>НеВыполненные</name>
      <description>Не выполненные</description>
    </items>
    <items>
      <name>Новые</name>
      <description>Новые</description>
    </items>
    <items>
      <name>Отклоненные</name>
      <description>Отклоненные</description>
    </items>
    <items>
      <name>Открытые</name>
      <description>Открытые</description>
    </items>
  </predefined>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписокСтатусов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Статусы</name>
    <attributes>
      <name>Статус</name>
      <type>
        <types>CatalogRef.СтатусыЗадач</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/СРМ/src/Enums/ВидыСтатусовЗадач/ВидыСтатусовЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСтатусовЗадач</name>
  <enumValues>
    <name>Новая</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
</mdclass:Enum>

src/СРМ/src/Catalogs/СтатусыЗадач/СтатусыЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатусыЗадач</name>
  <attributes>
    <name>Вид</name>
    <type>
      <types>EnumRef.ВидыСтатусовЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Редактор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинкиПрогресса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/СРМ/src/Catalogs/СпискиСтатусовЗадач/ManagerModule.bsl
Процедура ЗаполнитьПоУмолчанию() Экспорт
	
	НачатьТранзакцию();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Справочник.СпискиСтатусовЗадач");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыЗадач.Ссылка КАК Ссылка,
	|	СтатусыЗадач.Вид КАК Вид,
	|	СтатусыЗадач.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
	|ИЗ
	|	Справочник.СтатусыЗадач КАК СтатусыЗадач
	|ГДЕ
	|	НЕ СтатусыЗадач.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	РеквизитДопУпорядочивания";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Список_Новые = Справочники.СпискиСтатусовЗадач.Новые.ПолучитьОбъект();
	Список_ВРаботе = Справочники.СпискиСтатусовЗадач.ВРаботе.ПолучитьОбъект();
	Список_Выполненные = Справочники.СпискиСтатусовЗадач.Выполненные.ПолучитьОбъект();
	Список_Закрытые = Справочники.СпискиСтатусовЗадач.Закрытые.ПолучитьОбъект();
	Список_Открытые = Справочники.СпискиСтатусовЗадач.Открытые.ПолучитьОбъект();
	Список_НеВыполненные = Справочники.СпискиСтатусовЗадач.НеВыполненные.ПолучитьОбъект();
	Список_КВыполнению = Справочники.СпискиСтатусовЗадач.КВыполнению.ПолучитьОбъект();
	Список_Отклоненные = Справочники.СпискиСтатусовЗадач.Отклоненные.ПолучитьОбъект();
	
	Список_Новые.Статусы.Очистить();
	Список_ВРаботе.Статусы.Очистить();
	Список_Выполненные.Статусы.Очистить();
	Список_Закрытые.Статусы.Очистить();
	Список_Открытые.Статусы.Очистить();
	Список_НеВыполненные.Статусы.Очистить();
	Список_КВыполнению.Статусы.Очистить();
	Список_Отклоненные.Статусы.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Вид = Перечисления.ВидыСтатусовЗадач.Новая Тогда
			Список_Новые.Статусы.Добавить().Статус = Выборка.Ссылка;
			Список_Открытые.Статусы.Добавить().Статус = Выборка.Ссылка;
			Список_НеВыполненные.Статусы.Добавить().Статус = Выборка.Ссылка;
			Список_КВыполнению.Статусы.Добавить().Статус = Выборка.Ссылка;
		КонецЕсли;
		
		Если Выборка.Вид = Перечисления.ВидыСтатусовЗадач.ВРаботе Тогда
			Список_ВРаботе.Статусы.Добавить().Статус = Выборка.Ссылка;
			Список_Открытые.Статусы.Добавить().Статус = Выборка.Ссылка;
			Список_НеВыполненные.Статусы.Добавить().Статус = Выборка.Ссылка;
			Список_КВыполнению.Статусы.Добавить().Статус = Выборка.Ссылка;
		КонецЕсли;
		
		Если Выборка.Вид = Перечисления.ВидыСтатусовЗадач.Выполнена Тогда
			Список_Выполненные.Статусы.Добавить().Статус = Выборка.Ссылка;
			Список_Открытые.Статусы.Добавить().Статус = Выборка.Ссылка;
		КонецЕсли;
		
		Если Выборка.Вид = Перечисления.ВидыСтатусовЗадач.Закрыта Тогда
			Список_Закрытые.Статусы.Добавить().Статус = Выборка.Ссылка;
		КонецЕсли;
		
		Если Выборка.Вид = Перечисления.ВидыСтатусовЗадач.Отклонена Тогда
			Список_Отклоненные.Статусы.Добавить().Статус = Выборка.Ссылка;
		КонецЕсли;
		
	КонецЦикла;
	
	Список_Новые.Описание = "Все новые задачи. Возможно, требуется согласование";
	Список_ВРаботе.Описание = "Задачи, в настоящий момент находящиеся в работе";
	Список_Выполненные.Описание = "Задачи, выполненные нами, но ожидающие дополнительного действия. 
									|Например, задача сделана, но не выложена на рабочую базу
									|Или требуется обратная связь от клиента";
	Список_Закрытые.Описание = "Все закрытые задачи";
	Список_Открытые.Описание = "Все открытые задачи";
	Список_НеВыполненные.Описание = "Все не выполненные нами задачи (новые, в работе, на согласовании стоимости и т.п.";
	Список_КВыполнению.Описание = "Задачи, находящиеся в работе и те, которые можно брать в работу";
	Список_Отклоненные.Описание = "Отклоненные нами задачи (дубли, некорректно поставленные задачи и т.п.)";
	
	Список_Новые.Записать();
	Список_ВРаботе.Записать();
	Список_Выполненные.Записать();
	Список_Закрытые.Записать();
	Список_Открытые.Записать();
	Список_НеВыполненные.Записать();
	Список_КВыполнению.Записать();
	Список_Отклоненные.Записать();
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры
